---
type: IExternalCommandAvailability
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# IExternalCommandAvailability

`Autodesk.Revit.UI.IExternalCommandAvailability` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsCommandAvailable | — | `bool IsCommandAvailable ( UIApplication applicationData , CategorySet selectedCategories )` |